Learning and using pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Create a list of prices for medicines
med_price_list = [45, 34, 56, 78, 90]

In [3]:
#Convert the list into an array
med_price_array = np.array(med_price_list)

In [4]:
#convert list and array into pandas series object
series_list = pd.Series(med_price_list)
series_arr = pd.Series(med_price_array)

In [5]:
#print the series object
print(series_list)
print(series_arr)

0    45
1    34
2    56
3    78
4    90
dtype: int64
0    45
1    34
2    56
3    78
4    90
dtype: int32

Series has automatically got index labels

In [7]:
#Changing the index of a series
med_price_list_labelled = pd.Series(med_price_list, index=["Omeprazole","Azithromycin","Meetfroming",
"Ibuprofen","Cetirizine"])
print(med_price_list_labelled)

Omeprazole      45
Azithromycin    34
Meetfroming     56
Ibuprofen       78
Cetirizine      90
dtype: int64

Perfoming mathematical operations on Pandas Series

In [9]:
#Increment all prices by $2.5
med_price_list_labelled = med_price_list_labelled + 2.5
med_price_list_labelled

Omeprazole      50.0
Azithromycin    39.0
Meetfroming     61.0
Ibuprofen       83.0
Cetirizine      95.0
dtype: float64

In [10]:
#A new price list has been released by vendors for each medicine
new_price_list = [77,56,87,90,21]
new_price_list_labelled = pd.Series(new_price_list, index = ["Omeprazole","Azithromycin","Meetfroming",
"Ibuprofen","Cetirizine"])
new_price_list_labelled

Omeprazole      77
Azithromycin    56
Meetfroming     87
Ibuprofen       90
Cetirizine      21
dtype: int64

In [11]:
#Print difference between new price list and previous price list
print(new_price_list_labelled - med_price_list_labelled)

Omeprazole      27.0
Azithromycin    17.0
Meetfroming     26.0
Ibuprofen        7.0
Cetirizine     -74.0
dtype: float64

Pandas DataFrame is a two-dimensional tabular data structure with labelled axes(rows and columns)

In [12]:
#Creating a pandas dataframe
student = ["Mary","Peter","Susan","Toby","Vishal"]
df1 = pd.DataFrame(student, columns=["Student"])
df1

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

In [13]:
#Creating a Pandas DataFrame using a dictionary
grades = ["B-", "A+", "A-","B+","C"]

df2 = pd.DataFrame({"Student":student, "Grade": grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan    A-
3    Toby    B+
4  Vishal     C

In [14]:
student[0:3]

['Mary', 'Peter', 'Susan']

Creating a pandas dataframe using series

In [17]:
#Total energy consumption in the US between 2012 - 2018
year = pd.Series(np.arange(2012,2019,1))
energy_consumption = pd.Series([2152, 2196, 2217, 2194, 2172, 2180, 2258])

df3 = pd.DataFrame({"Year":year, "Energy_Consumption(Mtoe)":energy_consumption})
df3

   Year  Energy_Consumption(Mtoe)
0  2012                      2152
1  2013                      2196
2  2014                      2217
3  2015                      2194
4  2016                      2172
5  2017                      2180
6  2018                      2258

Creating a Pandas DataFrame using random values

In [18]:
df4 = pd.DataFrame(np.random.randn(5,2), columns = ["Trial 1", "Trial 2"])
df4

    Trial 1   Trial 2
0  0.570950  0.968798
1 -1.387334  0.065967
2  1.018330  1.088994
3 -0.240635 -0.189555
4 -0.868079 -0.073412

In [19]:
s = pd.Series([5,5,5,5], index=[0,1,2,3])
s

0    5
1    5
2    5
3    5
dtype: int64